controllers/ProjectController.php

SELECT * FROM `project` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Project::findOne($id)) !== null) {