models/User.php

	public static function findByUsername($username){
		return User::findOne(['username' => $username]);
---
SELECT * FROM `user` WHERE `username`='test1'